[
  {
    "path": "posts/2021-04-20-welcome/",
    "title": "Resources for learning R",
    "description": "Where to start when learning R and sources of help for more advanced topics.",
    "author": [
      {
        "name": "Bethan Thompson",
        "url": {}
      }
    ],
    "date": "2021-04-20",
    "categories": [],
    "contents": "\r\nOne motivation for this blog is to have a place to organise links to all my favourite R learning resources. As I’ve delved deeper into data science I found so many people’s blogs useful, in particular links to other resources, so I figured this is a good place to start. I also find myself sending students learning R the same links time again - so now there’s one link to rule them all!\r\nWhere to start?\r\nAll of these use the tidyverse approach which I think if you start as a non-programmer is the easiest and most accessible way to get up and running.\r\nMoving on with R\r\nThere are so many great websites and blogs on all sorts of topics. I follow a lot of #rstats on twitter and but I’ve often just come across them by googling when I came across a problem I couldn’t solve.\r\nIteration\r\nGoogling was how I came across Rebecca Barter’s article on purrr which I have since been back to many times! Similar with Ariel Muldoon whose article on automating exploratory plots helped me be much more efficient. Both of these blogs have a number of helpful posts on trickier topics. Recently I’ve found Nick Tierney’s blog which has lots of super short nifty posts like this one.\r\nUsing git\r\nUsing git was something I think I was shamed into by an old colleague - thanks Mike - since I had exactly the crazy document versioning he described in a talk. I did not at first understand how this would help me until I experienced the zen feeling that comes from only having only the latest version of a document in a folder yet access to v1 to v345 available at the touch of a button. As someone without a programming background I found most of the introduction to git materials intimidating and I have only ever used Jenny Brian’s Happy Git and GitHub for the useR book which I use any time I venture into doing anything other than stage, commit, push or pull. I actually use bitbucket rather than github for work related files but I’m trying to transfer examples where I can and also publish code through Zenodo.\r\nWorkflow\r\nA happy side effect of cruising R blogs is that I started to think about by data analysis workflow. This is something that will be a little different depending on your field but I have definitely taken inspiration from Rebecca Barter’s post on workflows. I also found this book from the Stanford Data Challenge Lab Course has some great pointers.\r\nWriting packages\r\nI never thought I would write a package until I came across Emily Riederers blog post and talk and and this book by Bruno Rodrigues. (https://b-rodrigues.github.io/modern_R/). But once I got to a particularly complex piece of analysis, that I also needed to share widely and realised this was actually just a neat way to document the analysis that I’d done and encourage me to develop testing\r\nStrucutral equation modelling packages\r\nI do quite a lot of structural equation modelling in my work. I have always used lavaan and once took a plane and several trains to Jena to one of Yves Rosseel’s workshops which was technical yet so entertaining. That was PhD dissertation procrastination at its best. Recently I came across a new package for partial least squares path modelling (PLS-PM) called cSEM which has such great documentation and the results are so easy to extract into neat tables for publications.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-16T19:35:43+01:00",
    "input_file": {}
  }
]
